projects/07_dam_break/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // Back face (z = 0)
    (0      0      0)       // 0
    (0.584  0      0)       // 1
    (0.584  0.584  0)       // 2
    (0      0.584  0)       // 3

    // Front face (z = 0.01)
    (0      0      0.01)    // 4
    (0.584  0      0.01)    // 5
    (0.584  0.584  0.01)    // 6
    (0      0.584  0.01)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (46 46 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
